Revit 2026 API

# ExportUtils Class

---

This class provides utilities related to document export.

SystemObject Autodesk.Revit.DBExportUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExportUtils
```
```vb
Public NotInheritable Class ExportUtils
```
```cpp
public ref class ExportUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExportUtils = class end
```

The ExportUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetExportId(Subelement) | Retrieves the GUID representing the subelement in DWF and IFC export. |
|  | GetExportId(Document, ElementId) | Retrieves the GUID representing this element in DWF and IFC export. |
|  | GetGBXMLDocumentId | Retrieves the GUID representing this document in exported gbXML files. |
|  | GetNurbsSurfaceDataForSurface | Returns the necessary information to define a NURBS surface for a given [!:Autodesk::Revit::DB::HermiteSuface] or [!:Autodesk::Revit::DB::RuledSuface]. |

#### Reference

Autodesk.Revit.DB Namespace